main_ls=[]

#(a,b,c,d)
# какая фигура 0 уголник, 1 угольник и тд макс 7 уугольник 0..7 mod 8
# (0,1,2,3,4,5,6,7) - 8 шт
# кол-во фигур на карточке от 1 до 9  0..8  mod 9
# (1,2,3,4,5,6,7,8,9)- 9 шт
# цвет фигур от красного до фиолетового КОЖЗГСФ  0..6 mod 7
# (кр, ор, жлт, зел, глб, син, фил )- 7 шт
# тип закраски нет закраски, верт полосы, верт+гор, верт +гор+ 2 диагонали, полная закраска 0..5 mod 6
# ([нет], [верт], [верт + диаг], [верт + диаг + гор], [верт + диаг + гор + диаг2 ], [полн заливка]) - 6 шт
# 8 9 7 6

count=1
a=0
b=0
c=0
d=0
while count<=81:
    main_ls.append((a, b, c, d))
    a = (a+1)%8
    b = (b+1)%9
    c = (c+1)%7
    d = (d+1)%6
    count+=1

print(main_ls)
print(len(main_ls))
print(len(set(main_ls)))